Documents/Бронирование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>Бронирование</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипНомера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипНомера</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаезда</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыезда</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Постояльцы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Постоялец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Постоялец</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Бронирование/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда	
		Возврат;	
	КонецЕсли;
	
	НужноРегистрировать = Истина;
	
	Если Не ЭтоНовый() И Не ЕстьИзменения() Тогда 
		НужноРегистрировать = Ложь;
	КонецЕсли;
	
	Если НужноРегистрировать Тогда
		ЗарегистрироватьКОбмену();
	КонецЕсли;
	
КонецПроцедуры

Функция ЕстьИзменения()

	Если ЭтоНовый() Тогда 
		Возврат Ложь;	 
	КонецЕсли; 
	
	ОбъектДоЗаписи = Ссылка.ПолучитьОбъект();
	
	Если ТипНомера <> ОбъектДоЗаписи.ТипНомера
		ИЛИ ДатаЗаезда <> ОбъектДоЗаписи.ДатаЗаезда
		ИЛИ ДатаВыезда <> ОбъектДоЗаписи.ДатаВыезда
       	ИЛИ НачалоДня(Дата) <> НачалоДня(ОбъектДоЗаписи.Дата) Тогда
		
		Возврат Истина;	
	КонецЕсли; 
	
	Если Постояльцы.Количество() <> ОбъектДоЗаписи.Постояльцы.Количество() Тогда
		Возврат Истина;	
	КонецЕсли;
	
	Для Сч = 0 По Постояльцы.Количество() - 1 Цикл
		Если Постояльцы[Сч].Постоялец <> ОбъектДоЗаписи.Постояльцы[Сч].Постоялец Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;

КонецФункции

Процедура ЗарегистрироватьКОбмену()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОбменМеждуСистемамиБронирования.Ссылка КАК Ссылка
	               |ИЗ
	               |	ПланОбмена.ОбменМеждуСистемамиБронирования КАК ОбменМеждуСистемамиБронирования
	               |ГДЕ
	               |	НЕ ОбменМеждуСистемамиБронирования.ЭтотУзел
	               |	И НЕ ОбменМеждуСистемамиБронирования.ПометкаУдаления";

	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл  
			
		ОбменДанными.Получатели.Добавить(Выборка.Ссылка);
	
	КонецЦикла;

КонецПроцедуры
